#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  		
	
	Диаграмма.Обновление = Ложь;    
	Диаграмма.Очистить();

	Для Каждого Строка Из ГрафикОтпусков Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		Серия = Диаграмма.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  
		
	КонецЦикла;	
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры  

#КонецОбласти
